; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=40, remove_proportion=0.2, bases=8, instance_id=24, output=./training, seed=65

(define (problem warehouse-24)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 box40 - box
        base1 base2 base3 base4 base5 base6 base7 base8 - base
    )
    (:init
        (to-remove box15)
        (to-remove box19)
        (to-remove box27)
        (to-remove box29)
        (to-remove box30)
        (to-remove box33)
        (to-remove box35)
        (to-remove box39)
        (clear box9)
        (on box9 box36)
        (on box36 box26)
        (on box26 box31)
        (on box31 box24)
        (on-base box24 base1)
        (clear box14)
        (on box14 box34)
        (on box34 box4)
        (on box4 box11)
        (on-base box11 base2)
        (clear box38)
        (on box38 box12)
        (on box12 box25)
        (on box25 box37)
        (on box37 box13)
        (on box13 box15)
        (on box15 box32)
        (on-base box32 base3)
        (clear box7)
        (on box7 box3)
        (on box3 box20)
        (on box20 box19)
        (on-base box19 base4)
        (clear box30)
        (on box30 box6)
        (on box6 box10)
        (on box10 box35)
        (on box35 box28)
        (on-base box28 base5)
        (clear box18)
        (on box18 box17)
        (on box17 box27)
        (on box27 box1)
        (on box1 box29)
        (on box29 box16)
        (on-base box16 base6)
        (clear box2)
        (on box2 box21)
        (on box21 box33)
        (on box33 box39)
        (on box39 box40)
        (on-base box40 base7)
        (clear box23)
        (on box23 box8)
        (on box8 box22)
        (on box22 box5)
        (on-base box5 base8)
    )
    (:goal (and 
        (removed box15)
        (removed box19)
        (removed box27)
        (removed box29)
        (removed box30)
        (removed box33)
        (removed box35)
        (removed box39)
    ))
)

; plan
1. (move box18 box17 box14)
   deleted: (clear box14) (on box18 box17)
   added: (on box18 box14) (clear box17)
   goals met: 0 of 8
2. (move box17 box27 box18)
   deleted: (clear box18) (on box17 box27)
   added: (on box17 box18) (clear box27)
   goals met: 0 of 8
3. (move box2 box21 box17)
   deleted: (clear box17) (on box2 box21)
   added: (on box2 box17) (clear box21)
   goals met: 0 of 8
4. (move box21 box33 box2)
   deleted: (clear box2) (on box21 box33)
   added: (on box21 box2) (clear box33)
   goals met: 0 of 8
5. (move box38 box12 box21)
   deleted: (clear box21) (on box38 box12)
   added: (on box38 box21) (clear box12)
   goals met: 0 of 8
6. (move box12 box25 box23)
   deleted: (clear box23) (on box12 box25)
   added: (on box12 box23) (clear box25)
   goals met: 0 of 8
7. (move box25 box37 box12)
   deleted: (clear box12) (on box25 box37)
   added: (on box25 box12) (clear box37)
   goals met: 0 of 8
8. (move box37 box13 box25)
   deleted: (clear box25) (on box37 box13)
   added: (on box37 box25) (clear box13)
   goals met: 0 of 8
9. (remove box27 box1)
   deleted: (on box27 box1) (clear box27)
   added: (removed box27) (clear box1)
   goals met: 1 of 8
10. (remove box30 box6)
   deleted: (on box30 box6) (clear box30)
   added: (removed box30) (clear box6)
   goals met: 2 of 8
11. (remove box33 box39)
   deleted: (on box33 box39) (clear box33)
   added: (removed box33) (clear box39)
   goals met: 3 of 8
12. (remove box39 box40)
   deleted: (on box39 box40) (clear box39)
   added: (removed box39) (clear box40)
   goals met: 4 of 8
13. (move box1 box29 box13)
   deleted: (clear box13) (on box1 box29)
   added: (on box1 box13) (clear box29)
   goals met: 4 of 8
14. (remove box29 box16)
   deleted: (on box29 box16) (clear box29)
   added: (removed box29) (clear box16)
   goals met: 5 of 8
15. (move box1 box13 box16)
   deleted: (clear box16) (on box1 box13)
   added: (on box1 box16) (clear box13)
   goals met: 5 of 8
16. (move box13 box15 box1)
   deleted: (clear box1) (on box13 box15)
   added: (on box13 box1) (clear box15)
   goals met: 5 of 8
17. (move box6 box10 box13)
   deleted: (clear box13) (on box6 box10)
   added: (on box6 box13) (clear box10)
   goals met: 5 of 8
18. (remove box15 box32)
   deleted: (on box15 box32) (clear box15)
   added: (removed box15) (clear box32)
   goals met: 6 of 8
19. (move box10 box35 box32)
   deleted: (clear box32) (on box10 box35)
   added: (on box10 box32) (clear box35)
   goals met: 6 of 8
20. (move box7 box3 box10)
   deleted: (clear box10) (on box7 box3)
   added: (on box7 box10) (clear box3)
   goals met: 6 of 8
21. (remove box35 box28)
   deleted: (on box35 box28) (clear box35)
   added: (removed box35) (clear box28)
   goals met: 7 of 8
22. (move box3 box20 box28)
   deleted: (clear box28) (on box3 box20)
   added: (on box3 box28) (clear box20)
   goals met: 7 of 8
23. (move box20 box19 box3)
   deleted: (clear box3) (on box20 box19)
   added: (on box20 box3) (clear box19)
   goals met: 7 of 8
24. (remove-from-base box19 base4)
   deleted: (on-base box19 base4) (clear box19)
   added: (removed box19) (clear-base base4)
   goals met: 8 of 8
